[
    {
        "filename": "NIT_Allahabad_Resume__11_ (5) (3).pdf",
        "category": "Resume",
        "summary": "Vaibhavi Agrawal is a B.Tech Chemical Engineering student at MNNIT, Prayagraj, who maintains a 7.32 CPI and is proficient in C++, JavaScript, and Data Structures. Her technical expertise is demonstrated through two major full-stack web applications: \"BookHeaven\" (a MERN stack bookstore) and \"Splitr\" (a serverless expense-splitting app utilizing Next.js and real-time architecture)."
    },
    {
        "filename": "CODE_KINETICS_ABSTRACT_TEAM_OPTIMIZERS.pdf",
        "category": "General",
        "summary": "Developed by the CODE KINETICS team, Project SPLITZ is a full-stack Web-Based Group Finance Tracker designed to automate expense splitting and efficiently settle debts in shared living situations. Built using the MERN stack, the application features secure JWT authentication, automated cost splitting algorithms, real-time debt alerts, and dynamic visual analytics for tracking group finances."
    },
    {
        "filename": "Screenshot (477).png",
        "category": "General",
        "summary": "The user is engaged in a diverse online session, with browser tabs open for AI tools (Gemini), web development (FastAPI), personal health analysis, and nature research, while currently viewing a scenic image of a valley and river. This activity is taking place on December 6, 2025, at 11:29 AM, in a location experiencing 19°C, sunny weather."
    },
    {
        "filename": "Data_analyst_route (1).pdf",
        "category": "General",
        "summary": "This document provides a structured compilation of links and resources for mastering essential technical skills across several domains. The resources cover core areas including SQL, Python programming (DSA and OOPS), data science libraries (Pandas, Numpy), Machine Learning, and Business Intelligence tools like PowerBI/Tableau."
    },
    {
        "filename": "NIT_Allahabad_Resume__7_ (1)_compressed.pdf",
        "category": "Resume",
        "summary": "Pushpalata (cid:131) +91-6206252098 Roll No.: 20232038 # pushpalata3083@gmail.com Bachelor of Technology # pushpalata.20232038@mnnit.ac.in Chemical Engineering § Pushpalata-S Motilal Nehru National In..."
    }
]